<?php

/*
#######################################################################################################

Приклади того, як можуть виглядати об'єкти, які містять з'єднання

$data_link = new PDO("mysql:host=localhost;dbname=api;charset=cp1251", "root", "");
$data_link = mysqli_connect("localhost", "root", "", "api");
$data_link = mysql_connect('localhost', 'root', '');

#######################################################################################################
*/




/* 
#######################################################################################################

Метод, який потрібно помістити в код  
Змінити значення змінних $host, $dbname, $user, $password на свої - використовуються для зміни налаштувань для PDO.

#######################################################################################################
*/

function FixEncoding($link, $charset, $show_driver = false){

$host = "localhost"; //по-замовчуванню localhost, якщо підключення відбувається не до зовнішньою БД
$dbname = "api"; //замінити на назву бази даних
$user = "root"; //змінити на свого користувача базою даних
$password = ""; //змінити на пароль користувача базою даних

if($link != null){

$driver_type = get_class($link);

switch($driver_type){
	case "PDO": 
	$link = new PDO("mysql:host=" . $host . ";dbname=" . $dbname . ";charset=" . $charset, $user, $password);
	if($show_driver === true) echo $driver_type;
	break;
	
	case "mysqli":
	$link->set_charset("utf8");
	if($show_driver === true) echo $driver_type;
	break;
	
	case "mysql":
	mysql_set_charset('utf8',$link);
	if($show_driver === true) echo $driver_type;
	break;
}

}else{
return false;
}
}


/* 
#######################################################################################################

Викликаємо цей метод перед першим входженням на запит 
$data_link - це об'єкт, який містить підключення, замість нього підставляєм свій об'єкт
"utf8" - строка з кодуванням, яке хочемо поставити
false - булеве значення для відображення назви драйвера, в процесі дебагу можна ставити на true, щоб побачити
який саме драйвер використовується

#######################################################################################################
*/
FixEncoding($data_link, "utf8", false);

?>